Revit 2016 API
RenderingImageExposureSettings.MidTones Property
 The midtones value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2013
Syntax
C#
public double MidTones { get; set; }
Visual Basic
Public Property MidTones As Double
	Get
	Set
Visual C++
public:
property double MidTones {
	double get ();
	void set (double value);
}
Remarks
 Increase this value to get brighter midtones.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The value of mid tones is not valid. The valid range is 0.1 to 4.
See Also
RenderingImageExposureSettings Class
Autodesk.Revit.DB Namespace